sqfmi/arduino-esp32/boards.txt
esp32s3.menu.CPUFreq.240=240MHz (WiFi)
esp32s3.menu.CPUFreq.240.build.f_cpu=240000000L
esp32s3.menu.CPUFreq.160=160MHz (WiFi)
esp32s3.menu.CPUFreq.160.build.f_cpu=160000000L
esp32s3.menu.CPUFreq.80=80MHz (WiFi)
esp32s3.menu.CPUFreq.80.build.f_cpu=80000000L
esp32s3.menu.CPUFreq.40=40MHz
esp32s3.menu.CPUFreq.40.build.f_cpu=40000000L
esp32s3.menu.CPUFreq.20=20MHz
esp32s3.menu.CPUFreq.20.build.f_cpu=20000000L
esp32s3.menu.CPUFreq.10=10MHz
esp32s3.menu.CPUFreq.10.build.f_cpu=10000000L

esp32s3.menu.UploadSpeed.921600=921600
esp32s3.menu.UploadSpeed.921600.upload.speed=921600
esp32s3.menu.UploadSpeed.115200=115200
esp32s3.menu.UploadSpeed.115200.upload.speed=115200
esp32s3.menu.UploadSpeed.256000.windows=256000
esp32s3.menu.UploadSpeed.256000.upload.speed=256000
esp32s3.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32s3.menu.UploadSpeed.230400=230400
esp32s3.menu.UploadSpeed.230400.upload.speed=230400
esp32s3.menu.UploadSpeed.460800.linux=460800
esp32s3.menu.UploadSpeed.460800.macosx=460800
esp32s3.menu.UploadSpeed.460800.upload.speed=460800
esp32s3.menu.UploadSpeed.512000.windows=512000
esp32s3.menu.UploadSpeed.512000.upload.speed=512000

esp32s3.menu.DebugLevel.none=None
esp32s3.menu.DebugLevel.none.build.code_debug=0
esp32s3.menu.DebugLevel.error=Error
esp32s3.menu.DebugLevel.error.build.code_debug=1
esp32s3.menu.DebugLevel.warn=Warn
esp32s3.menu.DebugLevel.warn.build.code_debug=2
esp32s3.menu.DebugLevel.info=Info
esp32s3.menu.DebugLevel.info.build.code_debug=3
esp32s3.menu.DebugLevel.debug=Debug
esp32s3.menu.DebugLevel.debug.build.code_debug=4
esp32s3.menu.DebugLevel.verbose=Verbose
esp32s3.menu.DebugLevel.verbose.build.code_debug=5

esp32s3.menu.EraseFlash.none=Disabled
esp32s3.menu.EraseFlash.none.upload.erase_cmd=
esp32s3.menu.EraseFlash.all=Enabled
esp32s3.menu.EraseFlash.all.upload.erase_cmd=-e

esp32s3.menu.ZigbeeMode.default=Disabled
esp32s3.menu.ZigbeeMode.default.build.zigbee_mode=
esp32s3.menu.ZigbeeMode.default.build.zigbee_libs=
esp32s3.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
esp32s3.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
esp32s3.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

watchy_v3.name=Watchy v3

watchy_v3.bootloader.tool=esptool_py
watchy_v3.bootloader.tool.default=esptool_py

watchy_v3.upload.tool=esptool_py
watchy_v3.upload.tool.default=esptool_py
watchy_v3.upload.tool.network=esp_ota

watchy_v3.upload.maximum_size=1310720
watchy_v3.upload.maximum_data_size=327680
watchy_v3.upload.flags=
watchy_v3.upload.extra_flags=
watchy_v3.upload.use_1200bps_touch=false
watchy_v3.upload.wait_for_upload_port=false

watchy_v3.serial.disableDTR=false
watchy_v3.serial.disableRTS=false

watchy_v3.build.tarch=xtensa
watchy_v3.build.bootloader_addr=0x0
watchy_v3.build.target=esp32s3
watchy_v3.build.mcu=esp32s3
watchy_v3.build.core=esp32
watchy_v3.build.variant=esp32s3
watchy_v3.build.board=WATCHY_V3

watchy_v3.build.usb_mode=1
watchy_v3.build.cdc_on_boot=0
watchy_v3.build.msc_on_boot=0
watchy_v3.build.dfu_on_boot=0
watchy_v3.build.f_cpu=240000000L
watchy_v3.build.flash_size=4MB
watchy_v3.build.flash_freq=80m
watchy_v3.build.flash_mode=dio
watchy_v3.build.boot=qio
watchy_v3.build.boot_freq=80m
watchy_v3.build.partitions=default
watchy_v3.build.defines=
watchy_v3.build.loop_core=
watchy_v3.build.event_core=
watchy_v3.build.psram_type=qspi
watchy_v3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
watchy_v3.menu.JTAGAdapter.default=Disabled
watchy_v3.menu.JTAGAdapter.default.build.copy_jtag_files=0
watchy_v3.menu.JTAGAdapter.builtin=Integrated USB JTAG
watchy_v3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
watchy_v3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
watchy_v3.menu.JTAGAdapter.external=FTDI Adapter
watchy_v3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
watchy_v3.menu.JTAGAdapter.external.build.copy_jtag_files=1
watchy_v3.menu.JTAGAdapter.bridge=ESP USB Bridge
watchy_v3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
watchy_v3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

watchy_v3.menu.PSRAM.disabled=Disabled
watchy_v3.menu.PSRAM.disabled.build.defines=
watchy_v3.menu.PSRAM.disabled.build.psram_type=qspi
watchy_v3.menu.PSRAM.enabled=QSPI PSRAM
watchy_v3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
watchy_v3.menu.PSRAM.enabled.build.psram_type=qspi
watchy_v3.menu.PSRAM.opi=OPI PSRAM
watchy_v3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
watchy_v3.menu.PSRAM.opi.build.psram_type=opi

watchy_v3.menu.FlashMode.qio=QIO 80MHz
watchy_v3.menu.FlashMode.qio.build.flash_mode=dio
watchy_v3.menu.FlashMode.qio.build.boot=qio
watchy_v3.menu.FlashMode.qio.build.boot_freq=80m
watchy_v3.menu.FlashMode.qio.build.flash_freq=80m
watchy_v3.menu.FlashMode.qio120=QIO 120MHz
watchy_v3.menu.FlashMode.qio120.build.flash_mode=dio
watchy_v3.menu.FlashMode.qio120.build.boot=qio
watchy_v3.menu.FlashMode.qio120.build.boot_freq=120m
watchy_v3.menu.FlashMode.qio120.build.flash_freq=80m
watchy_v3.menu.FlashMode.dio=DIO 80MHz
watchy_v3.menu.FlashMode.dio.build.flash_mode=dio
watchy_v3.menu.FlashMode.dio.build.boot=dio
watchy_v3.menu.FlashMode.dio.build.boot_freq=80m
watchy_v3.menu.FlashMode.dio.build.flash_freq=80m
watchy_v3.menu.FlashMode.opi=OPI 80MHz
watchy_v3.menu.FlashMode.opi.build.flash_mode=dout
watchy_v3.menu.FlashMode.opi.build.boot=opi
watchy_v3.menu.FlashMode.opi.build.boot_freq=80m
watchy_v3.menu.FlashMode.opi.build.flash_freq=80m

watchy_v3.menu.FlashSize.4M=4MB (32Mb)
watchy_v3.menu.FlashSize.4M.build.flash_size=4MB
watchy_v3.menu.FlashSize.8M=8MB (64Mb)
watchy_v3.menu.FlashSize.8M.build.flash_size=8MB
watchy_v3.menu.FlashSize.16M=16MB (128Mb)
watchy_v3.menu.FlashSize.16M.build.flash_size=16MB
watchy_v3.menu.FlashSize.32M=32MB (256Mb)
watchy_v3.menu.FlashSize.32M.build.flash_size=32MB

watchy_v3.menu.LoopCore.1=Core 1
watchy_v3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
watchy_v3.menu.LoopCore.0=Core 0
watchy_v3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

watchy_v3.menu.EventsCore.1=Core 1
watchy_v3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
watchy_v3.menu.EventsCore.0=Core 0
watchy_v3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

watchy_v3.menu.USBMode.hwcdc=Hardware CDC and JTAG
watchy_v3.menu.USBMode.hwcdc.build.usb_mode=1
watchy_v3.menu.USBMode.default=USB-OTG (TinyUSB)
watchy_v3.menu.USBMode.default.build.usb_mode=0

watchy_v3.menu.CDCOnBoot.default=Disabled
watchy_v3.menu.CDCOnBoot.default.build.cdc_on_boot=0
watchy_v3.menu.CDCOnBoot.cdc=Enabled
watchy_v3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

watchy_v3.menu.MSCOnBoot.default=Disabled
watchy_v3.menu.MSCOnBoot.default.build.msc_on_boot=0
watchy_v3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
watchy_v3.menu.MSCOnBoot.msc.build.msc_on_boot=1

